In [1]:
import pandas as pd
import numpy as np

In [2]:
people = {
    'first':['Corey', 'John', 'jane', 'Micky', np.nan, None, 'NA', 'Chris'],
    'last':['schafer', 'doe', 'doe', 'mouse', np.nan, np.nan, 'Missing', 'philip'],
    'email':['coreyschafer@email.com', 'johndoe@email.com', 'janedoe@email.com', None, 'mm@email.com', 'NA', np.nan, np.nan],
    'Age':[35,45,55, 36, None, None, 'Missing', 42]
}

In [3]:
df = pd.DataFrame(people)

df.replace('NA', np.nan, inplace = True)
df.replace('Missing', np.nan, inplace = True)

In [4]:
df

   first     last                   email   Age
0  Corey  schafer  coreyschafer@email.com  35.0
1   John      doe       johndoe@email.com  45.0
2   jane      doe       janedoe@email.com  55.0
3  Micky    mouse                    None  36.0
4    NaN      NaN            mm@email.com   NaN
5   None      NaN                     NaN   NaN
6    NaN      NaN                     NaN   NaN
7  Chris   philip                     NaN  42.0

In [5]:
df.dropna()

   first     last                   email   Age
0  Corey  schafer  coreyschafer@email.com  35.0
1   John      doe       johndoe@email.com  45.0
2   jane      doe       janedoe@email.com  55.0

In [6]:
df.dropna(how = 'all')

   first     last                   email   Age
0  Corey  schafer  coreyschafer@email.com  35.0
1   John      doe       johndoe@email.com  45.0
2   jane      doe       janedoe@email.com  55.0
3  Micky    mouse                    None  36.0
4    NaN      NaN            mm@email.com   NaN
7  Chris   philip                     NaN  42.0

In [7]:
df.dropna(axis = 'index', how = 'all')

   first     last                   email   Age
0  Corey  schafer  coreyschafer@email.com  35.0
1   John      doe       johndoe@email.com  45.0
2   jane      doe       janedoe@email.com  55.0
3  Micky    mouse                    None  36.0
4    NaN      NaN            mm@email.com   NaN
7  Chris   philip                     NaN  42.0

In [8]:
df.dropna(axis = 'columns', how = 'all')

   first     last                   email   Age
0  Corey  schafer  coreyschafer@email.com  35.0
1   John      doe       johndoe@email.com  45.0
2   jane      doe       janedoe@email.com  55.0
3  Micky    mouse                    None  36.0
4    NaN      NaN            mm@email.com   NaN
5   None      NaN                     NaN   NaN
6    NaN      NaN                     NaN   NaN
7  Chris   philip                     NaN  42.0

In [9]:
df.dropna(axis = 'columns', how = 'any')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7]

In [10]:
df.dropna(axis = 'index', how = 'all', subset =['email'])

   first     last                   email   Age
0  Corey  schafer  coreyschafer@email.com  35.0
1   John      doe       johndoe@email.com  45.0
2   jane      doe       janedoe@email.com  55.0
4    NaN      NaN            mm@email.com   NaN

In [11]:
df

   first     last                   email   Age
0  Corey  schafer  coreyschafer@email.com  35.0
1   John      doe       johndoe@email.com  45.0
2   jane      doe       janedoe@email.com  55.0
3  Micky    mouse                    None  36.0
4    NaN      NaN            mm@email.com   NaN
5   None      NaN                     NaN   NaN
6    NaN      NaN                     NaN   NaN
7  Chris   philip                     NaN  42.0

In [12]:
df.isna()

   first   last  email    Age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True  False   True
5   True   True   True   True
6   True   True   True   True
7  False  False   True  False

In [13]:
df.fillna(0)

   first     last                   email   Age
0  Corey  schafer  coreyschafer@email.com  35.0
1   John      doe       johndoe@email.com  45.0
2   jane      doe       janedoe@email.com  55.0
3  Micky    mouse                       0  36.0
4      0        0            mm@email.com   0.0
5      0        0                       0   0.0
6      0        0                       0   0.0
7  Chris   philip                       0  42.0

In [18]:
df.dtypes

first     object
last      object
email     object
Age      float64
dtype: object

In [19]:
df['Age'].mean()

42.6

# with real example

In [26]:
na_vals = ['NA', 'Missing']
df = pd.read_csv('survey_results_public.csv', index_col = 'ResponseId', na_values = na_vals)
schema_df = pd.read_csv('survey_results_schema.csv', index_col = 'qid')

In [29]:
df['YearsCode'].head(20)

ResponseId
1     NaN
2      18
3      27
4      12
5       6
6      21
7       4
8       5
9      20
10      6
11     14
12     10
13     10
14      5
15     15
16     15
17      4
18     11
19      3
20     24
Name: YearsCode, dtype: object

In [24]:
df['YearsCode'].astype(float)

ValueError: could not convert string to float: 'Less than 1 year'

In [27]:
df['YearsCode'].unique()

array([nan, '18', '27', '12', '6', '21', '4', '5', '20', '14', '10', '15',
       '11', '3', '24', '8', '13', 'Less than 1 year', '16', '33', '22',
       '30', '32', '7', '35', '28', '40', '17', '29', '19',
       'More than 50 years', '9', '38', '26', '34', '25', '2', '45', '23',
       '31', '43', '1', '48', '41', '50', '39', '42', '37', '36', '44',
       '46', '49', '47'], dtype=object)

In [30]:
df['YearsCode'].replace('Less than 1 year', 0, inplace = True)
df['YearsCode'].replace('More than 50 years', 51, inplace = True)

In [32]:
df['YearsCode'].unique()

array([nan, '18', '27', '12', '6', '21', '4', '5', '20', '14', '10', '15',
       '11', '3', '24', '8', '13', 0, '16', '33', '22', '30', '32', '7',
       '35', '28', '40', '17', '29', '19', 51, '9', '38', '26', '34',
       '25', '2', '45', '23', '31', '43', '1', '48', '41', '50', '39',
       '42', '37', '36', '44', '46', '49', '47'], dtype=object)

In [35]:
df['YearsCode'] = df['YearsCode'].astype(float)

In [36]:
df['YearsCode'].mean()

13.966855378281009

In [37]:
df['YearsCode'].median()

11.0